first = {
    1: 'один',
    2: 'два',
    3: 'три',
    4: 'четыре',
    5: 'пять',
    6: 'шесть',
    7: 'семь',
    8: 'восемь',
    9: 'девять',
    10: 'десять',
    11: 'одинадцать',
    12: 'двенадцать',
    13: 'тринадцать',
    14: 'четырнадцать',
    15: 'пятнадцать',
    16: 'шестнадцать',
    17: 'семнадцать',
    18: 'восемнадцать',
    19: 'девятнадцать',
}

second = {
    2: 'двадцать',
    3: 'тридцать',
    4: 'сорок',
    5: 'пятьдесять',
    6: 'шестьдесять',
    7: 'семьдесят',
    8: 'восемьдесят',
    9: 'девяносто',
}

    
def number_to_words(n):
    if n > 0 and n < 20:
        return first[n]
    elif n > 19 and n < 100:
        n1 = n // 10
        n2 = n % 10
        if n2 == 0:
            return second[n1]
        return second[n1] + ' ' + first[n2]